/*
09-0 删除指定值

题目描述
给定 n 个整数和一个整数 x，删除数组中所有等于 x 的元素，其余元素的相对顺序保持不变，
输出删除之后的数组。

输入格式
第一行给出两个整数 n 和 x（1 <= n <= 10^5，-10^9 <= x <= 10^9）。
第二行给出 n 个整数（每个数的绝对值不超过 10^9），中间以空格分隔。

输出格式
第一行输出删除后剩下元素的个数 m。
第二行输出剩下的 m 个整数，中间以一个空格分隔，行末不能有多余空格；
如果 m 等于 0，第二行只输出一个换行。

输入样例 1
5 3
1 3 3 5 3

输出样例 1
2
1 5

输入样例 2
3 9
9 9 9

输出样例 2
0

输入样例 3
4 -5
-5 7 -5 2

输出样例 3
2
7 2

*/

#include <stdio.h>

int main()
{
	int n,x;
	scanf("%d %d",&n,&x);
	int a[n];
	int i,j;
	for (i=0;i<n;i++) {
		scanf("%d",&a[i]);
	}
	for (i=0,j=0;i<n;i++) {
		if (a[i]!=x) {
			a[j]=a[i];
			j++;
		}
	}
	
	printf("%d\n",j);
	for (i=0;i<j;i++) {
		printf("%d",a[i]);
		if (i==j-1) {
			printf("\n");
		} else {
			printf(" ");
		}
	}
	
	return 0;
}
