/*
第3题：统计每个数出现次数
对应能力：统计每个数出现次数。
建议限时：15分钟
题目描述：
输入一个整数n，再输入n个整数。请统计每个出现过的数出现了多少次，并按照数值从小到大的顺序输出。
输入格式：
第一行输入一个整数n。
第二行输入n个整数。
输出格式：
每行输出一个出现过的数及其出现次数，格式为：
数值 次数
要求按照数值从小到大输出，只输出出现过的数。
数据范围：
1<=n<=100
0<=ai<=100
样例输入：
8
2 1 2 3 2 1 5 5
样例输出：
1 2
2 3
3 1
5 2
要求：
1.建议使用计数数组count[101]完成。
2.先统计每个数出现次数，再按数值从小到大输出。
3.只输出次数大于0的数。
4.注意输出格式，每行一个数。
*/

#include <stdio.h>

int main(void) {
	
	int n;
	scanf("%d",&n);
	
	int a[n];
	int count[101]={0};
	int i;
	
	for (i=0;i<n;i++) {
		scanf("%d",&a[i]);
	}
	
	for (i=0;i<n;i++) {
		count[a[i]]++;
	}
	
	for (i=0;i<101;i++) {
		if (count[i]>0) {
			printf("%d %d\n",i,count[i]);
		}
	}
	
	return 0;
}

//用时：10min