/*
第2题：数组原地反转
对应能力：数组反转。
建议限时：10分钟
题目描述：
输入一个整数n，再输入n个整数。请将数组原地反转，然后输出反转后的数组。
原地反转是指通过交换数组元素完成反转，不允许只倒着输出。
输入格式：
第一行输入一个整数n。
第二行输入n个整数。
输出格式：
输出反转后的数组，每个数之间用一个空格隔开，行末不要有多余空格。
数据范围：
1<=n<=100
-1000<=ai<=1000
样例输入1：
5
1 2 3 4 5
样例输出1：
5 4 3 2 1
样例输入2：
4
10 20 30 40
样例输出2：
40 30 20 10
要求：
1.必须用交换的方式反转数组。
2.循环次数建议为n/2。
3.注意n为奇数时，中间元素不需要交换。
4.输出格式要正确。
*/

#include <stdio.h>

void swap(int *a,int *b) {
	int t;
	t=*a;
	*a=*b;
	*b=t;
}

int main(void) {
	
	int n;
	scanf("%d",&n);
	
	int i;
	int a[n];
	for (i=0;i<n;i++) {
		scanf("%d",&a[i]);
	}
	
	int t;
	if (n%2==1) {
		t=(n-1)/2;
	} else {
		t=n/2;
	}
	
	for (i=0;i<t;i++) {
		swap(&a[i],&a[n-1-i]);
	}
	
	for (i=0;i<n;i++) {
		printf("%d",a[i]);
		if (i==n-1) {
			printf("\n");
		} else {
			printf(" ");
		}
	}
	
	return 0;
}

//用时:7min