/*
第4题：查找某个值
对应能力：在数组中查找某个值。
建议限时：10分钟
题目描述：
输入一个整数n，再输入n个整数，最后输入一个整数x。请查找x是否在数组中。
如果存在，输出它第一次出现的下标；如果不存在，输出-1。
下标从0开始。
输入格式：
第一行输入一个整数n。
第二行输入n个整数。
第三行输入一个整数x。
输出格式：
如果找到x，输出它第一次出现的下标；否则输出-1。
数据范围：
1<=n<=100
-1000<=ai<=1000
-1000<=x<=1000
样例输入1：
6
10 20 30 20 40 20
20
样例输出1：
1
样例输入2：
6
10 20 30 20 40 20
50
样例输出2：
-1
要求：
1.使用顺序查找。
2.找到第一次出现的位置后立即停止查找。
3.如果不存在，输出-1。
4.注意下标从0开始。
*/

#include <stdio.h>

int main() {
	
	int n;
	scanf("%d",&n);
	
	int i;
	int a[n];
	for (i=0;i<n;i++) {
		scanf("%d",&a[i]);
	}
	
	int x;
	scanf("%d",&x);
	
	int isfound=0;
	int position=0;
	
	for (i=0;i<n;i++) {
		if (a[i]==x) {
			isfound=1;
			position=i;
			break;
		}
	}
	
	if (isfound==1) {
		printf("%d\n",position);
	} else {
		printf("-1\n");
	}
	
	return 0;
}

//用时5min